lession2/homework/sysbench/point/sbtest.txt
[root@151-master lession2]#sysbench --config-file=config oltp_point_select --tables=32 --table-size=10000 prepare
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest5'...
Creating table 'sbtest3'...
Creating table 'sbtest8'...
Creating table 'sbtest4'...
Creating table 'sbtest1'...
Creating table 'sbtest2'...
Creating table 'sbtest6'...
Creating table 'sbtest7'...
Inserting 10000 records into 'sbtest4'
Inserting 10000 records into 'sbtest1'
Inserting 10000 records into 'sbtest5'
Inserting 10000 records into 'sbtest3'
Inserting 10000 records into 'sbtest6'
Inserting 10000 records into 'sbtest8'
Creating a secondary index on 'sbtest1'...
Inserting 10000 records into 'sbtest7'
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest5'...
Inserting 10000 records into 'sbtest2'
Creating a secondary index on 'sbtest8'...
Creating a secondary index on 'sbtest6'...
Creating a secondary index on 'sbtest7'...
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest9'...
Inserting 10000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest11'...
Inserting 10000 records into 'sbtest11'
Creating a secondary index on 'sbtest11'...
Creating table 'sbtest12'...
Inserting 10000 records into 'sbtest12'
Creating a secondary index on 'sbtest12'...
Creating table 'sbtest13'...
Inserting 10000 records into 'sbtest13'
Creating a secondary index on 'sbtest13'...
Creating table 'sbtest16'...
Inserting 10000 records into 'sbtest16'
Creating a secondary index on 'sbtest16'...
Creating table 'sbtest14'...
Inserting 10000 records into 'sbtest14'
Creating a secondary index on 'sbtest14'...
Creating table 'sbtest15'...
Inserting 10000 records into 'sbtest15'
Creating a secondary index on 'sbtest15'...
Creating table 'sbtest10'...
Inserting 10000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
Creating table 'sbtest17'...
Inserting 10000 records into 'sbtest17'
Creating a secondary index on 'sbtest17'...
Creating table 'sbtest19'...
Inserting 10000 records into 'sbtest19'
Creating a secondary index on 'sbtest19'...
Creating table 'sbtest20'...
Inserting 10000 records into 'sbtest20'
Creating a secondary index on 'sbtest20'...
Creating table 'sbtest21'...
Inserting 10000 records into 'sbtest21'
Creating a secondary index on 'sbtest21'...
Creating table 'sbtest24'...
Inserting 10000 records into 'sbtest24'
Creating a secondary index on 'sbtest24'...
Creating table 'sbtest22'...
Creating table 'sbtest23'...
Inserting 10000 records into 'sbtest22'
Inserting 10000 records into 'sbtest23'
Creating a secondary index on 'sbtest22'...
Creating a secondary index on 'sbtest23'...
Creating table 'sbtest18'...
Creating table 'sbtest25'...
Inserting 10000 records into 'sbtest18'
Inserting 10000 records into 'sbtest25'
Creating a secondary index on 'sbtest18'...
Creating a secondary index on 'sbtest25'...
Creating table 'sbtest27'...
Inserting 10000 records into 'sbtest27'
Creating a secondary index on 'sbtest27'...
Creating table 'sbtest28'...
Inserting 10000 records into 'sbtest28'
Creating a secondary index on 'sbtest28'...
Creating table 'sbtest29'...
Inserting 10000 records into 'sbtest29'
Creating a secondary index on 'sbtest29'...
Creating table 'sbtest32'...
Inserting 10000 records into 'sbtest32'
Creating table 'sbtest30'...
Creating a secondary index on 'sbtest32'...
Inserting 10000 records into 'sbtest30'
Creating a secondary index on 'sbtest30'...
Creating table 'sbtest31'...
Inserting 10000 records into 'sbtest31'
Creating a secondary index on 'sbtest31'...
Creating table 'sbtest26'...
Inserting 10000 records into 'sbtest26'
Creating a secondary index on 'sbtest26'...
[root@151-master lession2]#sysbench --config-file=config oltp_point_select --tables=32 --table-size=10000 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1950.76 qps: 1950.76 (r/w/o: 1950.76/0.00/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1804.19 qps: 1804.19 (r/w/o: 1804.19/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 2088.12 qps: 2088.12 (r/w/o: 2088.12/0.00/0.00) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1972.26 qps: 1972.26 (r/w/o: 1972.26/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1805.10 qps: 1805.10 (r/w/o: 1805.10/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1647.13 qps: 1647.13 (r/w/o: 1647.13/0.00/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 1754.50 qps: 1754.50 (r/w/o: 1754.50/0.00/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 2077.92 qps: 2077.92 (r/w/o: 2077.92/0.00/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 1666.71 qps: 1666.71 (r/w/o: 1666.71/0.00/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1362.96 qps: 1362.96 (r/w/o: 1362.96/0.00/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 2000.72 qps: 2000.72 (r/w/o: 2000.72/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 1297.97 qps: 1297.97 (r/w/o: 1297.97/0.00/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 8 tps: 1663.97 qps: 1663.97 (r/w/o: 1663.97/0.00/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 8 tps: 1390.52 qps: 1390.52 (r/w/o: 1390.52/0.00/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 8 tps: 1174.00 qps: 1174.00 (r/w/o: 1174.00/0.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 8 tps: 1831.14 qps: 1831.14 (r/w/o: 1831.14/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 8 tps: 1670.03 qps: 1670.03 (r/w/o: 1670.03/0.00/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 8 tps: 1796.79 qps: 1796.79 (r/w/o: 1796.79/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 8 tps: 1997.62 qps: 1997.62 (r/w/o: 1997.62/0.00/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 8 tps: 1773.92 qps: 1773.92 (r/w/o: 1773.92/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 8 tps: 1828.87 qps: 1828.87 (r/w/o: 1828.87/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 8 tps: 1755.09 qps: 1755.09 (r/w/o: 1755.09/0.00/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 8 tps: 1608.52 qps: 1608.52 (r/w/o: 1608.52/0.00/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 8 tps: 1831.90 qps: 1831.90 (r/w/o: 1831.90/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 8 tps: 1979.08 qps: 1979.08 (r/w/o: 1979.08/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 8 tps: 1745.96 qps: 1745.96 (r/w/o: 1745.96/0.00/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 8 tps: 2106.50 qps: 2106.50 (r/w/o: 2106.50/0.00/0.00) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 8 tps: 1886.96 qps: 1886.96 (r/w/o: 1886.96/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 8 tps: 1388.62 qps: 1388.62 (r/w/o: 1388.62/0.00/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 8 tps: 1352.10 qps: 1352.10 (r/w/o: 1352.10/0.00/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 8 tps: 1237.99 qps: 1237.99 (r/w/o: 1237.99/0.00/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 8 tps: 1690.25 qps: 1690.25 (r/w/o: 1690.25/0.00/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 8 tps: 1558.77 qps: 1558.77 (r/w/o: 1558.77/0.00/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 8 tps: 1628.82 qps: 1628.82 (r/w/o: 1628.82/0.00/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 8 tps: 1658.37 qps: 1658.37 (r/w/o: 1658.37/0.00/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 8 tps: 877.78 qps: 877.78 (r/w/o: 877.78/0.00/0.00) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 8 tps: 937.90 qps: 937.90 (r/w/o: 937.90/0.00/0.00) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 8 tps: 2023.78 qps: 2023.78 (r/w/o: 2023.78/0.00/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 8 tps: 1756.07 qps: 1756.07 (r/w/o: 1756.07/0.00/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 8 tps: 2016.86 qps: 2016.86 (r/w/o: 2016.86/0.00/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 8 tps: 1716.07 qps: 1716.07 (r/w/o: 1716.07/0.00/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 8 tps: 1926.89 qps: 1926.89 (r/w/o: 1926.89/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 8 tps: 1869.99 qps: 1869.99 (r/w/o: 1869.99/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 8 tps: 1404.82 qps: 1404.82 (r/w/o: 1404.82/0.00/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 8 tps: 1433.71 qps: 1433.71 (r/w/o: 1433.71/0.00/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 8 tps: 1870.68 qps: 1870.68 (r/w/o: 1870.68/0.00/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 8 tps: 1763.90 qps: 1763.90 (r/w/o: 1763.90/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 8 tps: 1679.83 qps: 1679.83 (r/w/o: 1679.83/0.00/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 8 tps: 1856.55 qps: 1856.55 (r/w/o: 1856.55/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 8 tps: 2236.93 qps: 2236.93 (r/w/o: 2236.93/0.00/0.00) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 8 tps: 2200.73 qps: 2200.73 (r/w/o: 2200.73/0.00/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 8 tps: 1884.38 qps: 1884.38 (r/w/o: 1884.38/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 8 tps: 1634.88 qps: 1634.88 (r/w/o: 1634.88/0.00/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 8 tps: 1490.09 qps: 1490.09 (r/w/o: 1490.09/0.00/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 8 tps: 1749.24 qps: 1749.24 (r/w/o: 1749.24/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 8 tps: 1843.39 qps: 1843.39 (r/w/o: 1843.39/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 8 tps: 2081.35 qps: 2081.35 (r/w/o: 2081.35/0.00/0.00) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 8 tps: 1968.54 qps: 1968.54 (r/w/o: 1968.54/0.00/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 8 tps: 1721.87 qps: 1721.87 (r/w/o: 1721.87/0.00/0.00) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 8 tps: 1284.75 qps: 1284.75 (r/w/o: 1284.75/0.00/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1032180
        write:                           0
        other:                           0
        total:                           1032180
    transactions:                        1032180 (1720.15 per sec.)
    queries:                             1032180 (1720.15 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0480s
    total number of events:              1032180

Latency (ms):
         min:                                    0.69
         avg:                                    4.65
         max:                                 1421.81
         95th percentile:                       10.84
         sum:                              4795716.11

Threads fairness:
    events (avg/stddev):           129022.5000/220.79
    execution time (avg/stddev):   599.4645/0.09